<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,?,?,3" element_type="u8" />
			<output>
				<port id="0" precision="U8" names="image">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,C]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="/Constant_29_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 4" offset="0" size="8" />
			<output>
				<port id="0" precision="FP16" names="/Constant_29_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/Constant_29" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_11_output_0" />
			</output>
		</layer>
		<layer id="4" name="Constant_64912" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="16" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_64913" type="Const" version="opset1">
			<data element_type="f32" shape="2" offset="8" size="8" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_64914" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="32" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Interpolate_64915" type="Interpolate" version="opset4">
			<data mode="linear" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="round_prefer_floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="U8">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convert_64916" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_64917" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 3" offset="48" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Subtract_64918" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_66343" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 3" offset="60" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Divide_64920" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_64921" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="72" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Transpose_64922" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>800</dim>
					<dim>992</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>800</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="onnx::Conv_2489_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="104" size="1728" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2489">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx::Conv_2489" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/backbone/init_block/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>800</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_68862_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1832" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_68862" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone/init_block/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/init_block/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/init_block/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/init_block/activ/Clip_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_2492_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="1896" size="2048" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2492">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="onnx::Conv_2492" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/backbone/stage1/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_68879_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="3944" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_68879" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/stage1/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/backbone/stage1/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv1/activ/Clip_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_68892_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="4008" size="576" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_68892" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/backbone/stage1/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_68942_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4584" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_68942" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/stage1/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/stage1/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv2/activ/Clip_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="onnx::Conv_2498_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="4648" size="1024" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2498">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_2498" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/backbone/stage1/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_68959_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5672" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_68959" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/backbone/stage1/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv3/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="onnx::Conv_2501_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="5704" size="3072" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2501">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="onnx::Conv_2501" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/backbone/stage2/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_68972_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="8776" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_68972" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/backbone/stage2/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/stage2/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv1/activ/Clip_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_68985_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="8968" size="1728" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_68985" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/stage2/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>400</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_69035_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="10696" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_69035" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/backbone/stage2/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/stage2/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv2/activ/Clip_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="onnx::Conv_2507_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="10888" size="4608" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2507">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Conv_2507" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/backbone/stage2/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_69052_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="15496" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_69052" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/backbone/stage2/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv3/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="onnx::Conv_2510_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="15544" size="6912" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2510">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="onnx::Conv_2510" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/backbone/stage2/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_69065_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="22456" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_69065" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/backbone/stage2/unit2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/stage2/unit2/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv1/activ/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_69078_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="22744" size="2592" />
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_69078" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/backbone/stage2/unit2/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_69128_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="25336" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_69128" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/backbone/stage2/unit2/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/stage2/unit2/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv2/activ/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="onnx::Conv_2516_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="25624" size="6912" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2516">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx::Conv_2516" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/backbone/stage2/unit2/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_69145_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="32536" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_69145" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/backbone/stage2/unit2/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv3/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/stage2/unit2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/Add_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="onnx::Conv_2519_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="32584" size="6912" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2519">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx::Conv_2519" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/stage3/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_69159_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="39496" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_69159" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/stage3/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone/stage3/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv1/activ/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_69172_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="39784" size="2592" />
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_69172" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/stage3/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>200</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_69222_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="42376" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_69222" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/backbone/stage3/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone/stage3/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv2/activ/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="onnx::Conv_2525_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 144, 1, 1" offset="42664" size="9216" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2525">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Conv_2525" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/stage3/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape_69239_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="51880" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_69239" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/backbone/stage3/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv3/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="onnx::Conv_2528_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 32, 1, 1" offset="51944" size="12288" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_2528">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="onnx::Conv_2528" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/backbone/stage3/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>100</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_69252_compressed" type="Const" version="opset1">
